RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_ospi.h
/* OSPI address size */
#define OSPI_ADDRSZ(regval)               (BITS(12,13) & ((uint32_t)(regval) << 12U))
#define OSPI_ADDRESS_8_BITS               OSPI_ADDRSZ(0)                       /*!< address size on 8-bit address */
#define OSPI_ADDRESS_16_BITS              OSPI_ADDRSZ(1)                       /*!< address size on 16-bit address */
#define OSPI_ADDRESS_24_BITS              OSPI_ADDRSZ(2)                       /*!< address size on 24-bit address */
#define OSPI_ADDRESS_32_BITS              OSPI_ADDRSZ(3)                       /*!< address size on 32-bit address */

/* OSPI address double transfer rate */
#define OSPI_ADDRDTR_MODE_DISABLE         0x00000000U                          /*!< address double transfer rate mode disable */
#define OSPI_ADDRDTR_MODE_ENABLE          OSPI_TCFG_ADDRDTR                    /*!< address double transfer rate mode disable */

/* OSPI alternate bytes mode */
#define OSPI_ALTEMOD(regval)              (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define OSPI_ALTERNATE_BYTES_NONE         OSPI_ALTEMOD(0)                      /*!< no alternate bytes mode */
#define OSPI_ALTERNATE_BYTES_1_LINE       OSPI_ALTEMOD(1)                      /*!< alternate bytes mode on a single line */
#define OSPI_ALTERNATE_BYTES_2_LINES      OSPI_ALTEMOD(2)                      /*!< alternate bytes mode on two lines */
#define OSPI_ALTERNATE_BYTES_4_LINES      OSPI_ALTEMOD(3)                      /*!< alternate bytes mode on four lines */
#define OSPI_ALTERNATE_BYTES_8_LINES      OSPI_ALTEMOD(4)                      /*!< alternate bytes mode on eight lines */

/* OSPI alternate bytes size */
#define OSPI_ALTESZ(regval)               (BITS(20,21) & ((uint32_t)(regval) << 20U))
#define OSPI_ALTERNATE_BYTES_8_BITS       OSPI_ALTESZ(0)                       /*!< alternate bytes size on 8-bit address */
#define OSPI_ALTERNATE_BYTES_16_BITS      OSPI_ALTESZ(1)                       /*!< alternate bytes size on 16-bit address */
#define OSPI_ALTERNATE_BYTES_24_BITS      OSPI_ALTESZ(2)                       /*!< alternate bytes size on 24-bit address */
#define OSPI_ALTERNATE_BYTES_32_BITS      OSPI_ALTESZ(3)                       /*!< alternate bytes size on 32-bit address */

/* OSPI alternate bytes double transfer rate */
#define OSPI_ABDTR_MODE_DISABLE           0x00000000U                          /*!< alternate bytes double transfer rate mode disable */
#define OSPI_ABDTR_MODE_ENABLE            OSPI_TCFG_ABDTR                      /*!< alternate bytes double transfer rate mode enable */

/* OSPI data mode */
#define OSPI_DATAMOD(regval)              (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define OSPI_DATA_NONE                    OSPI_DATAMOD(0)                      /*!< no data mode */
#define OSPI_DATA_1_LINE                  OSPI_DATAMOD(1)                      /*!< data mode on a single line */
#define OSPI_DATA_2_LINES                 OSPI_DATAMOD(2)                      /*!< data mode on two lines */
#define OSPI_DATA_4_LINES                 OSPI_DATAMOD(3)                      /*!< data mode on four lines */
#define OSPI_DATA_8_LINES                 OSPI_DATAMOD(4)                      /*!< data mode on eight lines */

/* OSPI data double transfer rate */
#define OSPI_DADTR_MODE_DISABLE           0x00000000U                          /*!< data double transfer rate mode disable */
#define OSPI_DADTR_MODE_ENABLE            OSPI_TCFG_DADTR                      /*!< data double transfer rate mode enable */

/* OSPI dummy cycles */
#define OSPI_DUMYC(regval)                (BITS(0,4) & ((uint32_t)(regval) << 0U))
#define OSPI_DUMYC_CYCLES_0               OSPI_DUMYC(0)                        /*!< duration of the dummy instruction phase is 0 cycle */
#define OSPI_DUMYC_CYCLES_1               OSPI_DUMYC(1)                        /*!< duration of the dummy instruction phase is 1 cycle */
#define OSPI_DUMYC_CYCLES_2               OSPI_DUMYC(2)                        /*!< duration of the dummy instruction phase is 2 cycle */
#define OSPI_DUMYC_CYCLES_3               OSPI_DUMYC(3)                        /*!< duration of the dummy instruction phase is 3 cycle */
#define OSPI_DUMYC_CYCLES_4               OSPI_DUMYC(4)                        /*!< duration of the dummy instruction phase is 4 cycle */
#define OSPI_DUMYC_CYCLES_5               OSPI_DUMYC(5)                        /*!< duration of the dummy instruction phase is 5 cycle */
#define OSPI_DUMYC_CYCLES_6               OSPI_DUMYC(6)                        /*!< duration of the dummy instruction phase is 6 cycle */
#define OSPI_DUMYC_CYCLES_7               OSPI_DUMYC(7)                        /*!< duration of the dummy instruction phase is 7 cycle */
#define OSPI_DUMYC_CYCLES_8               OSPI_DUMYC(8)                        /*!< duration of the dummy instruction phase is 8 cycle */
#define OSPI_DUMYC_CYCLES_9               OSPI_DUMYC(9)                        /*!< duration of the dummy instruction phase is 9 cycle */
#define OSPI_DUMYC_CYCLES_10              OSPI_DUMYC(10)                       /*!< duration of the dummy instruction phase is 10 cycle */
#define OSPI_DUMYC_CYCLES_11              OSPI_DUMYC(11)                       /*!< duration of the dummy instruction phase is 11 cycle */
#define OSPI_DUMYC_CYCLES_12              OSPI_DUMYC(12)                       /*!< duration of the dummy instruction phase is 12 cycle */
#define OSPI_DUMYC_CYCLES_13              OSPI_DUMYC(13)                       /*!< duration of the dummy instruction phase is 13 cycle */
#define OSPI_DUMYC_CYCLES_14              OSPI_DUMYC(14)                       /*!< duration of the dummy instruction phase is 14 cycle */
#define OSPI_DUMYC_CYCLES_15              OSPI_DUMYC(15)                       /*!< duration of the dummy instruction phase is 15 cycle */
#define OSPI_DUMYC_CYCLES_16              OSPI_DUMYC(16)                       /*!< duration of the dummy instruction phase is 16 cycle */
#define OSPI_DUMYC_CYCLES_17              OSPI_DUMYC(17)                       /*!< duration of the dummy instruction phase is 17 cycle */
#define OSPI_DUMYC_CYCLES_18              OSPI_DUMYC(18)                       /*!< duration of the dummy instruction phase is 18 cycle */
#define OSPI_DUMYC_CYCLES_19              OSPI_DUMYC(19)                       /*!< duration of the dummy instruction phase is 19 cycle */
#define OSPI_DUMYC_CYCLES_20              OSPI_DUMYC(20)                       /*!< duration of the dummy instruction phase is 20 cycle */
#define OSPI_DUMYC_CYCLES_21              OSPI_DUMYC(21)                       /*!< duration of the dummy instruction phase is 21 cycle */
#define OSPI_DUMYC_CYCLES_22              OSPI_DUMYC(22)                       /*!< duration of the dummy instruction phase is 22 cycle */
#define OSPI_DUMYC_CYCLES_23              OSPI_DUMYC(23)                       /*!< duration of the dummy instruction phase is 23 cycle */
#define OSPI_DUMYC_CYCLES_24              OSPI_DUMYC(24)                       /*!< duration of the dummy instruction phase is 24 cycle */
#define OSPI_DUMYC_CYCLES_25              OSPI_DUMYC(25)                       /*!< duration of the dummy instruction phase is 25 cycle */
#define OSPI_DUMYC_CYCLES_26              OSPI_DUMYC(26)                       /*!< duration of the dummy instruction phase is 26 cycle */
#define OSPI_DUMYC_CYCLES_27              OSPI_DUMYC(27)                       /*!< duration of the dummy instruction phase is 27 cycle */
#define OSPI_DUMYC_CYCLES_28              OSPI_DUMYC(28)                       /*!< duration of the dummy instruction phase is 28 cycle */
#define OSPI_DUMYC_CYCLES_29              OSPI_DUMYC(29)                       /*!< duration of the dummy instruction phase is 29 cycle */
#define OSPI_DUMYC_CYCLES_30              OSPI_DUMYC(30)                       /*!< duration of the dummy instruction phase is 30 cycle */
#define OSPI_DUMYC_CYCLES_31              OSPI_DUMYC(31)                       /*!< duration of the dummy instruction phase is 31 cycle */

/* OSPI delay hold quarter cycle */
#define OSPI_DELAY_HOLD_NONE              0x00000000U                          /*!< OSPI no delay hold cycle */
#define OSPI_DELAY_HOLD_QUARTER_CYCLE     OSPI_TIMCFG_DEHQC                    /*!< OSPI delay hold 1/4 cycle */

/* OSPI sample shift */
#define OSPI_SAMPLE_SHIFTING_NONE         0x00000000U                          /*!< OSPI no sample shift */
#define OSPI_SAMPLE_SHIFTING_HALF_CYCLE   OSPI_TIMCFG_SSAMPLE                  /*!< OSPI have 1/2 cycle sample shift */

